Repository: tonyruizo/SchedulingSystemWPF
Catalog: SchedulingSystemWPF/Resources/Lang.*.resx
Languages: es

# AlertError
source: Failed to check upcoming appointments: {0}
es: No se pudo verificar las citas próximas: {0}

# AllFieldsRequired
source: All fields must be filled.
es: Todos los campos deben estar llenos.

# AppointmentAdded
source: Appointment has been added!
es: ¡Cita añadida!

source: Appointment Alert
es: Alerta de Cita

# AppointmentMessageFormat
source: Appointment: {0} with {1} at {2}
es: Cita: {0} con {1} a las {2}

source: Appointment updated!
es: ¡Cita actualizada!

# BusinessHoursError
source: Appointments must be scheduled between 9:00 AM and 5:00 PM EST, Monday–Friday.
es: Las citas deben programarse entre las 9:00 y las 17:00 EST, de lunes a viernes.

# ConfirmDelete
source: Are you sure you want to delete this?
es: ¿Estás seguro de que quieres eliminar esto?

# CustomerAdded
source: Customer has been added!
es: ¡Cliente añadido!

# CustomerUpdated
source: Customer has been updated!
es: ¡Cliente actualizado!

# DeleteFailed
source: Failed to delete: {0}
es: No se pudo eliminar: {0}

# EndAfterStart
source: End time must be after Start time.
es: La hora de fin debe ser posterior a la hora de inicio.

# InvalidName
source: Customer’s name cannot be a number.
es: El nombre del cliente no puede ser un número.

# InvalidPhone
source: Please enter a valid 7-digit phone number (e.g., 1234567).
es: Por favor, ingrese un número de teléfono válido de 7 dígitos (e.g., 1234567).

# InvalidPhoneFormat
source: Please enter a valid phone number containing digits and optional dashes (e.g., 1234567).
es: Por favor, ingrese un número de teléfono válido que contenga dígitos y guiones opcionales (e.g., 1234567 o 123-4567).

# InvalidPostalCode
source: Please enter a valid postal code (digits only, up to 5 characters).
es: Por favor, ingrese un código postal válido (solo dígitos, hasta 7 caracteres).

# InvalidTimeFormat
source: Please enter the time in HH:MM format. (e.g., 02:00)
es: Por favor, ingrese la hora en formato HH:MM (e.g., 02:00).

# InvalidUrl
source: Please enter a valid URL (e.g., https://example.com).
es: Por favor, ingrese una URL válida (e.g., https://example.com).

# NoCustomerSelected
source: Please select a customer to edit or delete.
es: Por favor, seleccione un cliente para editar o eliminar.

# OverlapError
source: This appointment overlaps with an existing appointment.
es: Esta cita se superpone con una cita existente.

# SaveCustomerFailed
source: Failed to save customer: {0}
es: No se pudo guardar el cliente: {0}

# SaveFailed
source: Failed to save appointment: {0}
es: No se pudo guardar el cliente: {0}

# SessionNotFound
source: User session not found. Please log in again.
es: Sesión de usuario no encontrada. Por favor, inicie sesión nuevamente.

# UpcomingAppointments
source: Upcoming appointments within 15 minutes:
es: Citas próximas dentro de 15 minutos:
